Revit 2027 API
PanelScheduleData.ShowMultipleRowsForMultiphaseCircuits Property
 shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowMultipleRowsForMultiphaseCircuits { get; set; }
Public Property ShowMultipleRowsForMultiphaseCircuits As Boolean
	Get
	Set
public:
property bool ShowMultipleRowsForMultiphaseCircuits {
	bool get ();
	void set (bool value);
}
member ShowMultipleRowsForMultiphaseCircuits : bool with get, set
Property Value
Boolean
Remarks
 only applicable to one column formats
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace